In [1]:
import pandas as pd
import numpy as np

In [2]:
#1.Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
# data=pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
# 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
# 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
# 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},
# index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
# data

In [3]:
#1.Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
dict={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data=pd.DataFrame(dict,index=labels)
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [4]:
#2.Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [5]:
#3.Write a Pandas program to get the first 3 rows of a given DataFrame
# dd=data[0:3]
# dd
data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
#4.Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2
greater=data[data['attempts']>2]
greater

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [9]:
#5.Write a Pandas program to count the number of rows and columns of a DataFrame
no_of_rows=len(data.axes[0])
no_of_rows

10

In [10]:
no_of_columns=len(data.axes[1])
no_of_columns

4

In [11]:
#6.Write a Pandas program to select the rows where the score is missing, i.e. is NaN
null=data[data['score'].isnull()]
null

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [12]:
# 7.Write a Pandas program to select the rows the score is between 15 and 20
rows_between=data[data['score'].between(15,20)]
rows_between

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes